<?php
class SearchVars {

    //全部变速箱类型映射,来源是car_model表
    public static $GEARBOX_ALL = array(
        1 => '手动',
        2 => '自动',
        3 => '手自一体',
        4 => '双离合自动',
        5 => '无级/手动一体式',
        6 => '无极变速',
        7 => '双离合',
        8 => 'MT',
        9 => 'AT',
        10 => '10电子无级变速',
        11 => '8挡手自一体',
        12 => 'AMT',
        13 => 'CVT',
        14 => 'CVT无极变速',
        15 => '6挡手自一体',
        16 => '6挡手动',
        17 => '自动挡',
        18 => '手动挡',
        19 => '手动四驱',
        20 => '连续手自一体',
        21 => '手动两驱',
        22 => '53座',
        23 => '4速自动',
        24 => 'XTronic无级',
    );

    public static $TYPE_ID_ADAPT = array(
        1 => 1,
        2 => 4,
        3 => 2,
        4 => 3,
        5 => 6,
        6 => 7,
        7 => 8,
        8 => 5,
    );

}

